; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image2 - mode
	spectrograph3 - mode
	thermograph1 - mode
	infrared5 - mode
	spectrograph0 - mode
	infrared4 - mode
	Star1 - direction
	GroundStation3 - direction
	Star0 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared4)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared5)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Star6 spectrograph3)
	(have_image Planet7 infrared5)
	(have_image Planet7 infrared4)
	(have_image Planet8 thermograph1)
	(have_image Planet9 image2)
	(have_image Planet9 spectrograph3)
	(have_image Planet10 spectrograph0)
	(have_image Phenomenon11 image2)
	(have_image Star12 spectrograph3)
	(have_image Star13 image2)
	(have_image Planet14 thermograph1)
	(have_image Planet15 spectrograph0)
	(have_image Planet15 infrared4)
))

)

; plan
1. (turn_to satellite1 groundstation2 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 14
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 14
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 14
4. (turn_to satellite1 planet8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet8)
   goals met: 0 of 14
5. (take_image satellite1 planet8 instrument2 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 1 of 14
6. (turn_to satellite1 planet14 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet14)
   goals met: 1 of 14
7. (turn_to satellite0 star0 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star0)
   goals met: 1 of 14
8. (take_image satellite1 planet14 instrument2 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 2 of 14
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 14
10. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 14
11. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 2 of 14
12. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 14
13. (turn_to satellite0 phenomenon11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 14
14. (take_image satellite0 phenomenon11 instrument0 image2)
   added: (have_image phenomenon11 image2)
   goals met: 3 of 14
15. (turn_to satellite0 planet10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet10)
   goals met: 3 of 14
16. (take_image satellite0 planet10 instrument0 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 4 of 14
17. (turn_to satellite0 planet15 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet15)
   goals met: 4 of 14
18. (take_image satellite0 planet15 instrument0 infrared4)
   added: (have_image planet15 infrared4)
   goals met: 5 of 14
19. (take_image satellite0 planet15 instrument0 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 6 of 14
20. (turn_to satellite0 planet7 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet7)
   goals met: 6 of 14
21. (take_image satellite0 planet7 instrument0 infrared4)
   added: (have_image planet7 infrared4)
   goals met: 7 of 14
22. (turn_to satellite0 planet9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet9)
   goals met: 7 of 14
23. (take_image satellite0 planet9 instrument0 image2)
   added: (have_image planet9 image2)
   goals met: 8 of 14
24. (turn_to satellite0 star13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star13)
   goals met: 8 of 14
25. (take_image satellite0 star13 instrument0 image2)
   added: (have_image star13 image2)
   goals met: 9 of 14
26. (turn_to satellite0 star4 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star4)
   goals met: 10 of 14
27. (turn_to satellite1 groundstation2 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation2)
   goals met: 10 of 14
28. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 10 of 14
29. (turn_to satellite1 planet7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet7)
   goals met: 10 of 14
30. (take_image satellite1 planet7 instrument1 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 11 of 14
31. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 11 of 14
32. (take_image satellite1 planet9 instrument1 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 12 of 14
33. (turn_to satellite1 star12 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star12)
   goals met: 12 of 14
34. (take_image satellite1 star12 instrument1 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 13 of 14
35. (turn_to satellite1 star6 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star6)
   goals met: 13 of 14
36. (take_image satellite1 star6 instrument1 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 14 of 14
